Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Заказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аттракцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Аттракционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродажаБилета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБилета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеныБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБилета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПродажаБилета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипБилета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеныБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБилета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Оплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьЦенуБилета(Ссылка)
	Возврат Ссылка.Цена;
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуБилета()
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.ЦенаБилета * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаТипБилетаПриИзменении(Элемент)
	ТекСтрока = Элементы.ПродажаБилета.ТекущиеДанные;
	ЦенаБилета = ПолучитьЦенуБилета(ТекСтрока.ТипБилета);
	ТекСтрока.ЦенаБилета = ЦенаБилета;
	РассчитатьСуммуБилета();
КонецПроцедуры

&НаКлиенте
Процедура ПродажаБилетаКоличествоПриИзменении(Элемент)
	 РассчитатьСуммуБилета();
КонецПроцедуры

&НаСервере
Процедура ЗаказПриИзмененииНаСервере()
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.ДатаПосещения КАК ДатаПосещения,
		|	ЗаказПродажаБилета.ТипБилета КАК ТипБилета,
		|	ЗаказПродажаБилета.ЦенаБилета КАК ЦенаБилета,
		|	ЗаказПродажаБилета.Количество КАК Количество,
		|	ЗаказПродажаБилета.Сумма КАК Сумма
		|ИЗ
		|	Документ.Заказ.ПродажаБилета КАК ЗаказПродажаБилета
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.Заказ КАК Заказ
		|		ПО ЗаказПродажаБилета.Ссылка = Заказ.Ссылка
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.ПродажаБилета.Очистить();
	
	Пока Выборка.Следующий() Цикл
	Объект.ДатаПосещения = Выборка.ДатаПосещения;	
	НоваяСтрока = Объект.ПродажаБилета.Добавить();
	НоваяСтрока.ТипБилета = Выборка.ТипБилета;
	НоваяСтрока.ЦенаБилета = Выборка.ЦенаБилета;
	НоваяСтрока.Количество = Выборка.Количество;
	НоваяСтрока.Сумма = Выборка.Сумма;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ЗаказПриИзмененииНаСервере();
КонецПроцедуры
